---
kind: type
id: T:Autodesk.Revit.DB.Electrical.LoadClassification
source: html/931b70a7-2ea6-765d-68a5-677fc2d988c4.htm
---
# Autodesk.Revit.DB.Electrical.LoadClassification

An enumerated type to list all demand factor classifications.

## Syntax (C#)
```csharp
public enum LoadClassification
```